In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ['Tanishq', 'Harry', 'shubh', 'mohan','rahul'],
    "marks":[95,93,24,17,85],
    "city":['pune','kolkata','mumbai','antartica','USSR']
}

In [3]:
df = pd.DataFrame(dict1) #Create a table (DATAFRAME)

In [4]:
df

      name  marks       city
0  Tanishq     95       pune
1    Harry     93    kolkata
2    shubh     24     mumbai
3    mohan     17  antartica
4    rahul     85       USSR

In [5]:
#to export it as csv
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_index_false.csv', index=False)

In [7]:
df.head(2)

      name  marks     city
0  Tanishq     95     pune
1    Harry     93  kolkata

In [8]:
df.tail(2)

    name  marks       city
3  mohan     17  antartica
4  rahul     85       USSR

In [9]:
df.describe()

           marks
count   5.000000
mean   62.800000
std    38.874156
min    17.000000
25%    24.000000
50%    85.000000
75%    93.000000
max    95.000000

In [10]:
tanishq1 = pd.read_csv('tanishq.csv')

In [11]:
tanishq1

  NAME  MARKS       CITY
0  TAN     97       pune
1  HAR     93    kolkata
2  SHB     24     mumbai
3   MH     17  antartica

In [12]:
tanishq1['MARKS'][0] = 97

/tmp/ipykernel_7856/2847764650.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  tanishq1['MARKS'][0] = 97
/tmp/ipykernel_7856/2847764650.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  tanishq1['MARKS'][0] = 97

In [13]:
tanishq1

  NAME  MARKS       CITY
0  TAN     97       pune
1  HAR     93    kolkata
2  SHB     24     mumbai
3   MH     17  antartica

In [14]:
tanishq1.to_csv('tanishq.csv', index=False)

In [15]:
tanishq1

  NAME  MARKS       CITY
0  TAN     97       pune
1  HAR     93    kolkata
2  SHB     24     mumbai
3   MH     17  antartica

In [16]:
tanishq1.index = ['first', 'second', 'third','fourth']

In [17]:
tanishq1

       NAME  MARKS       CITY
first   TAN     97       pune
second  HAR     93    kolkata
third   SHB     24     mumbai
fourth   MH     17  antartica

In [21]:
ser = pd.Series(np.random.rand(34))

In [22]:
ser

0     0.336935
1     0.192479
2     0.321492
3     0.012300
4     0.288285
5     0.357819
6     0.240360
7     0.785251
8     0.024546
9     0.277226
10    0.888729
11    0.373960
12    0.137839
13    0.464880
14    0.009879
15    0.803482
16    0.027103
17    0.110381
18    0.104759
19    0.809240
20    0.870416
21    0.284132
22    0.435278
23    0.207748
24    0.624325
25    0.097008
26    0.046125
27    0.525944
28    0.605886
29    0.104728
30    0.314867
31    0.030936
32    0.630094
33    0.539039
dtype: float64

In [23]:
type(ser)

pandas.core.series.Series

In [27]:
newdf = pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [28]:
type(newdf)

pandas.core.frame.DataFrame

In [29]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.489497    0.521887    0.509092    0.509192    0.508516
std      0.285057    0.289322    0.291338    0.286347    0.278655
min      0.000054    0.000078    0.006659    0.001567    0.001313
25%      0.232709    0.254929    0.263367    0.256621    0.289240
50%      0.491812    0.565239    0.514531    0.521293    0.508990
75%      0.738379    0.778899    0.762091    0.752558    0.748531
max      0.999189    0.994452    0.996254    0.988000    0.998484

In [30]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [32]:
newdf.head()

          0         1         2         3         4
0  0.498636  0.775937  0.982065  0.492641  0.511601
1  0.852041  0.698626  0.850319  0.713532  0.871545
2  0.052014  0.145250  0.266707  0.808252  0.677651
3  0.211685  0.543938  0.134813  0.446065  0.290358
4  0.056211  0.759030  0.590138  0.139816  0.059720

In [33]:
newdf[0][0] = "tanishq"

/tmp/ipykernel_7856/683224355.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = "tanishq"
/tmp/ipykernel_7856/683224355.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'tanishq' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "tanishq"

In [34]:
newdf.head()

          0         1         2         3         4
0   tanishq  0.775937  0.982065  0.492641  0.511601
1  0.852041  0.698626  0.850319  0.713532  0.871545
2  0.052014  0.145250  0.266707  0.808252  0.677651
3  0.211685  0.543938  0.134813  0.446065  0.290358
4  0.056211  0.759030  0.590138  0.139816  0.059720

In [36]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [37]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [39]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)